request1.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:gs="http://localhost:7991/universities">
    <soapenv:Header/>
    <soapenv:Body>
        <gs:getUniversityByLocationRequest>
            <gs:location>Thika</gs:location>
        </gs:getUniversityByLocationRequest>
    </soapenv:Body>
</soapenv:Envelope>